In [3]:
import pandas as pd

# Q1. List any five functions of the pandas library with execution.

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head() #head() function returns the first n rows of a DataFrame, by default the n=5.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail() #head() function returns the Last n rows of a DataFrame, by default the n=5.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df.columns # using .columns function, you can print out all the columns of the dataset:

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
len(df) # Provides with the length of the DataFrame.

891

In [13]:
df["Sex"].unique() #It is used to find out the unique values of a categorical column.

array(['male', 'female'], dtype=object)

In [14]:
df.describe() # provides some basic statistical measures of the Dataframe.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [17]:
data = {'A': [1,2,3,4,5,6,7,8,9,10,11,12],
       'B': ['a','b','c','d','e','f','g','h','i','j','k','l'],
       'C': ['A','B','C','D','E','F','G','H','I','J','K','L']}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

     A  B  C
0    1  a  A
1    2  b  B
2    3  c  C
3    4  d  D
4    5  e  E
5    6  f  F
6    7  g  G
7    8  h  H
8    9  i  I
9   10  j  J
10  11  k  K
11  12  l  L

In [22]:
new_index = list(range(1,len(df)*2,2))
new_index

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23]

In [23]:
df.index = new_index
df

     A  B  C
1    1  a  A
3    2  b  B
5    3  c  C
7    4  d  D
9    5  e  E
11   6  f  F
13   7  g  G
15   8  h  H
17   9  i  I
19  10  j  J
21  11  k  K
23  12  l  L

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [48]:
data1 = {'Values': [10, 20, 30, 40, 50],
        'A': [1,2,3,4,5,]}
df1 = pd.DataFrame(data1)

In [49]:
df1

   Values  A
0      10  1
1      20  2
2      30  3
3      40  4
4      50  5

In [50]:
def sumof(df):
    sum = 0
    count = 0
    for i in df['Values']:
        sum = sum+i
        count += 1
        if count == 3:
            break
    return sum

In [51]:
sumof(df1)

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [55]:
data = {'Text': ['Salad is for rabbits','Our school building is made of bricks', 'There is no play with fire', 'Stop talking and open your book', 'Cats hate water']}
df = pd.DataFrame(data)
df

                                    Text
0                   Salad is for rabbits
1  Our school building is made of bricks
2             There is no play with fire
3        Stop talking and open your book
4                        Cats hate water

In [60]:
def count_words(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
    return df
count_words(df)

                                    Text  Word_Count
0                   Salad is for rabbits           4
1  Our school building is made of bricks           7
2             There is no play with fire           6
3        Stop talking and open your book           6
4                        Cats hate water           3

# Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size()** Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

**DataFrame.shape()** Returns tuple of shape (Rows, columns) of dataframe/series

In [61]:
df.size

10

In [62]:
df.shape

(5, 2)

# Q6. Which function of pandas do we use to read an excel file?

**pd.read_excel()** function of pandas is used to read an excel file

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [64]:
data = {"Email":["alex@gmail.com", "sunny@yahoo.com", "kiran@yahoo.com", "navya@gmail.com", "bob15@gmail.com"]}

df = pd.DataFrame(data)
df

             Email
0   alex@gmail.com
1  sunny@yahoo.com
2  kiran@yahoo.com
3  navya@gmail.com
4  bob15@gmail.com

In [66]:
usernames = []
def names(x):
    for i in x['Email']:
        name = i.split("@")
        usernames.append(name[0])
    return usernames

names(df)

['alex', 'sunny', 'kiran', 'navya', 'bob15']

In [67]:
df["Username"] = usernames
df

             Email Username
0   alex@gmail.com     alex
1  sunny@yahoo.com    sunny
2  kiran@yahoo.com    kiran
3  navya@gmail.com    navya
4  bob15@gmail.com    bob15

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [5]:
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2],
       }

df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [69]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

In [70]:
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [4]:
data1 = {'Values': [10, 20, 30, 40, 50],
        'A': [1,2,3,4,5,]}
df1 = pd.DataFrame(data1)
df1

   Values  A
0      10  1
1      20  2
2      30  3
3      40  4
4      50  5

In [13]:
def find_statics(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std

mean, median, std = find_statics(df1)
print("Mean: {} Median: {} Standard deviation: {}".format(mean,median,std))

Mean: 30.0 Median: 30.0 Standard deviation: 15.811388300841896

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [25]:
import pandas as pd
import numpy as np

np.random.seed(123)
sales_data = {'Sales': np.random.randint(100, size=10),
              'Date': pd.date_range('2022-01-01', periods=10, freq='D')}
df = pd.DataFrame(sales_data)

In [26]:
def add_moving_average(df):
    # Sort DataFrame by date in ascending order
    df = df.sort_values('Date')
    
    # Create a new column for the moving average
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

In [29]:
add_moving_average(df)

   Sales       Date  MovingAverage
0     66 2022-01-01      66.000000
1     92 2022-01-02      79.000000
2     98 2022-01-03      85.333333
3     17 2022-01-04      68.250000
4     83 2022-01-05      71.200000
5     57 2022-01-06      68.833333
6     86 2022-01-07      71.285714
7     97 2022-01-08      75.714286
8     96 2022-01-09      76.285714
9     47 2022-01-10      69.000000

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [33]:

def add_weekday_column(df):
    # Convert the 'Date' column to a datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Add a new column with the weekday name
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

In [34]:
add_weekday_column(df)

   Sales       Date    Weekday
0     66 2022-01-01   Saturday
1     92 2022-01-02     Sunday
2     98 2022-01-03     Monday
3     17 2022-01-04    Tuesday
4     83 2022-01-05  Wednesday
5     57 2022-01-06   Thursday
6     86 2022-01-07     Friday
7     97 2022-01-08   Saturday
8     96 2022-01-09     Sunday
9     47 2022-01-10     Monday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [51]:
data = {
    'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-03-02','2023-01-04','2023-01-05', '2023-01-06','2023-02-02','2023-03-02']
}

df = pd.DataFrame(data)

def select_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    dates = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
    selected_rows = df.loc[dates]
    
    return selected_rows

In [52]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-03-02
4  2023-01-04
5  2023-01-05
6  2023-01-06
7  2023-02-02
8  2023-03-02

In [53]:
select_dates(df)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
4 2023-01-04
5 2023-01-05
6 2023-01-06

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
pandas